{
    "skills": [
      {
        "name": "Python",
        "description": "Python is a versatile and powerful programming language often used for web development, data analysis, and automation."
      },
      {
        "name": "React",
        "description": "React is a popular JavaScript library for building user interfaces. It allows for the creation of reusable UI components and facilitates efficient rendering of data-driven views."
      },
      {
        "name": "Angular",
        "description": "Angular is a TypeScript-based open-source framework for building web applications. It provides a comprehensive set of features for developing scalable and maintainable front-end applications."
      },
      {
        "name": "C",
        "description": "C is a general-purpose programming language known for its efficiency and low-level programming capabilities. It is widely used in systems programming and embedded systems development."
      },
      {
        "name": "C++",
        "description": "C++ is a powerful programming language that extends the capabilities of C with additional features, such as object-oriented programming. It is commonly used in game development and performance-critical applications."
      },
      {
        "name": "C#",
        "description": "C# (C Sharp) is a modern, object-oriented programming language developed by Microsoft. It is commonly used for building Windows applications, web services, and game development with Unity."
      },
      {
        "name": "HTML",
        "description": "HTML (Hypertext Markup Language) is the standard markup language for creating web pages and web applications. It provides the structure and content of a webpage."
      },
      {
        "name": "CSS",
        "description": "CSS (Cascading Style Sheets) is a stylesheet language used for describing the presentation and styling of HTML documents. It enables the customization of the appearance and layout of web pages."
      },
      {
        "name": "Sass",
        "description": "Sass is a CSS preprocessor that extends the capabilities of CSS with features like variables, mixins, and nested rules. It improves code maintainability and productivity."
      },
      {
        "name": "JavaScript",
        "description": "JavaScript is a widely-used scripting language that enables dynamic and interactive web content. It is essential for client-side web development and has gained popularity for server-side development as well."
      },
      {
        "name": "TypeScript",
        "description": "TypeScript is a typed superset of JavaScript that compiles to plain JavaScript. It adds static typing and advanced language features to JavaScript, making it more scalable and maintainable."
      },
      {
        "name": "Django",
        "description": "Django is a high-level Python web framework that follows the Model-View-Controller (MVC) architectural pattern. It simplifies the development of complex web applications by providing robust tools and conventions."
      },
      {
        "name": "Shell",
        "description": "Shell scripting refers to the creation and execution of scripts written for command-line interpreters or shell environments. It is commonly used for automating tasks and system administration."
      },
      {
        "name": "MySQL",
        "description": "MySQL is an open-source relational database management system. It is widely used for storing and retrieving data in web applications, ranging from small-scale websites to large enterprise systems."
      },
      {
        "name": "SQLite",
        "description": "SQLite is a lightweight and self-contained database engine. It is embedded within applications and doesn't require a separate server process. SQLite is commonly used for local data storage in mobile and desktop applications."
      },
      {
        "name": "MongoDB",
        "description": "MongoDB is a popular NoSQL database that provides flexible document storage. It is known for its scalability and ability to handle large volumes of unstructured data. MongoDB is widely used in modern web development."
      }
    ]
  }
  