[
	{
		"name": "42",
		"photo": "42lisboa.png",
		"id": 1,
		"link": "https://www.42lisboa.com/",
		"description": "Programming school founded in 2013 in Paris and has schools in more than 20 countries. The teaching methodology is totally innovative with practical projects, group learning, earning points and working on a team. I learned a lot about programming logic, solving problems quickly, automation, unit testing, optimized programming, OOP and much more.",
		"learnings": ["C", "C++", "Shell", "Team Work", "Time Management"],
		"docs_type": "Check my 42 projects",
		"docs_link": "https://github.com/pedromessetti"
	},
	{
		"name": "Alura",
		"photo": "alura.png",
		"id": 2,
		"link": "https://www.alura.com.br/",
		"description": "Biggest online technology school in Brazil. It has courses in several areas, my learning focus was on Front-End Development for understanding how the connection between Back-End and Front-End works. I learned many concepts of Web Development, Front-End frameworks, supersets, webservices, API's and libraries. Take a look at my certificates from the courses.",
		"learnings": ["Python", "HTML", "CSS", "JS/TS", "React", "Sass"],
		"docs_type": "See my certificates",
		"docs_link": "https://www.linkedin.com/in/pedro-messetti/details/certifications/"
	},
	{
		"name": "CEV",
		"photo": "cev.png",
		"id": 3,
		"link": "https://youtube.com/playlist?list=PLHz_AreHm4dm6wYOIW20Nyg12TAjmMGT-",
		"description": "Online classes on Youtube with professor Gustavo Guanabara about basic knowledges of Python 3 such as functions, arrays, tuples, dictionarys, modules, error tratements, exceptions, conditions, types and operators. Take a look at my Git repository and see the exercises that I did using my learnings.",
		"learnings": ["Python"],
		"docs_type": "Check the repository",
		"docs_link": "https://github.com/pedromessetti/aulas-curso-em-video-python"
	},
	{
		"name": "UFF",
		"photo": "uff.png",
		"id": 4,
		"link": "https://www.uff.br/",
		"description": "At Universidade Federal Fluminense (UFF) I studied until the 4th period of Engineering and Industrial Management. I learned many concepts about Agile Methodologies, administration of companies and also C++.",
		"learnings": ["SCRUM", "PMBOK", "C++", "Industrial Strategic Planning", "Operational Planning"],
		"docs_type": "See my articles",
		"docs_link": "https://drive.google.com/drive/folders/1w4y4c1i7Ecr1tDQYSvPghEOZfmNKX2G_?usp=share_link"
	},
	{
		"name": "CLAC",
		"photo": "clac.png",
		"id": 5,
		"link": "https://clac.letras.ufrj.br/",
		"description": "CLAC is an extension project of the Faculty of Letters of the Federal University of Rio de Janeiro and aims to promote language courses for the community, providing a space where UFRJ Letters graduates practice teaching in a reflective, conscious and qualitative way. , under the guidance of the professors of this institution.",
		"learnings": ["English"],
		"docs_type": "See my certificate",
		"docs_link": "https://drive.google.com/file/d/1fELPqvSMHeYPwA6qjxSQGcsaFLtBjhtv/view?usp=share_link"
	}
]